# We keep this here as well as in the installation script
# So that we can later use this file for 'brew bundle cleanup'
tap 'homebrew/bundle'

# specify a directory to install
#$cask_args appdir: '/Applications'

# General setup
brew 'autojump'
brew 'coreutils' # In case the ones existing is outdated.
brew 'git'
brew 'htop'
brew 'jq'
brew 'nvm'
brew 'node'
brew 'python'
brew 'zsh'
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'
brew 'powerlevel10k'
brew 'antigen'
brew 'jenv'


# Apps
cask 'ghostty'
cask 'iterm2'
cask 'arc'
cask 'slack'
cask 'notion'
cask '1password'
cask 'signal'

cask 'temurin@17'
cask 'temurin@21'
cask 'temurin'
